package com.npes87184.pokeresearchdictionary.Dict

class ChtDict : BaseDict() {
    override val mapMissionReward = mapOf(
            "參加1次道館戰" to "猴怪/戴魯比/小火龍/蚊香蝌蚪/妙蛙種子",
            "參加5次道館戰" to "腕力/妙蛙種子",
            "贏得3次道館戰" to "迷唇姐",
            "贏得2次團體戰" to "火岩鼠",
            "贏得5次團體戰" to "火爆獸",
            "在7場道館戰使用屬性加成技" to "電擊獸",
            "捕獲10隻寶可夢" to "鯉魚王/雷電球/蛋蛋",
            "捕獲5隻天氣加成寶可夢" to "六尾/蚊香蝌蚪/伊布",
            "捕獲20隻天氣加成寶可夢" to "九尾",
            "捕獲1隻龍系寶可夢" to "迷你龍",
            "捕獲3隻蟲系寶可夢" to "凱羅斯",
            "捕獲3隻惡系寶可夢" to "戴魯比",
            "捕獲3隻電系寶可夢" to "皮卡丘",
            "捕獲3隻火系寶可夢" to "熔岩蝸牛",
            "捕獲3隻飛行系寶可夢" to "嘟嘟",
            "捕獲3隻毒系寶可夢" to "臭泥/鬼斯/妙蛙種子",
            "捕獲5隻火系寶可夢" to "火伊布",
            "捕獲3隻草.火.地系寶可夢" to "呆火駝",
            "捕獲3隻喵喵.向尾喵" to "卡蒂狗",
            "捕獲3隻木守宮.水躍魚" to "火稚雞",
            "捕獲3隻波波.黑暗鴉" to "阿柏蛇",
            "捕獲3隻走路草.喇叭芽" to "蔓藤怪",
            "進化1隻寶可夢" to "伊布",
            "進化5隻火屬性寶可夢" to "火伊布",
            "孵化1顆蛋" to "蛋蛋",
            "孵化3顆蛋" to "鴨嘴火龍",
            "孵化5顆蛋" to "吉利蛋",
            "進行5次寶可夢強化" to "妙蛙種子/小火龍/傑尼龜",
            "擲出3顆Nice球" to "雷電球",
            "擲出5顆Nice球" to "雷電球",
            "擲出3顆Great球" to "鬼斯",
            "連續擲出3顆Great球" to "大岩蛇",
            "連續擲出3顆Great曲球" to "火恐龍",
            "擲出3顆Excellent球" to "幼基拉斯",
            "連續擲出3顆Excellent球" to "幼基拉斯",
            "轉3個未曾轉過補給站牌" to "小火馬"
            )

    init {

    }
}